%%----------------------------Student Program----------------------------%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % LabName:             AM调制解调实验
% % Task:                1.根据例程，使用包络检波法进行解调，思考两种解调方式
%                          的差异，完成AM调制解调实验
% %                      2.绘制出AM调制解调过程波形图，将已调信号和解调信号分别
% %                       输出CH1、CH2，用示波器观察信号时域波形和已调信号频谱 
% %  Programming tips:   1.调制：调制信号叠加直流分量后与载波相乘得到已调信号
% %                      2.信道加噪：已调信号加入噪声得到加噪声后信号
% %                      3.带通滤波器：滤除噪声信号
% %                      4.解调：包络检波法和相干解调法
% %                        包络检波法：使用包络检波法，用
% %                        hilbert函数解调（取绝对值），去除直流分量得到解调信   
% %                        号
% %                      5.输出波形
% %                         绘制出AM调制解调过程波形图
% %                         示波器CH1通道输出调制信号波形
% %                         示波器CH2通道输出已调信号波形        
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

clc
clear
close all
PC_IP = '192.168.1.180';
XSRP_IP = '192.168.1.166';
fs=30720000;% 采样率,硬件系统基准采样率30.72 MHz，fs可配30.72MHz, 3.72Mhz，307.2KHz , 30.72KHz，或其它(要求fs需被30720000整除).fs最大可配30.72MHz,fs最小可配30000Hz
runType=1;%运行方式，0表示仿真，1表示软硬结合

A = 5;      %调制信号幅度
A0 = 10;     %直流分量
F=10000;    %调制信号频率
Fc=50000;   %载波频率
N=30720 ;    %采样点数
snr=10;   % 信道输出端信噪比/dB

%% 1.调制

%生成调制信号
dt=1/fs;
t=0:dt:(N-1)*dt;
y1=A*sin(2*pi*F*t);	    %调制信号
y2=y1+A0;               %加直流分量后信号
y3=cos(2*pi*Fc*t);      %载波信号

y4=y2.*y3;              %已调信号（调制信号加直流分量后 乘载波信号 ）

%% 2.信道加噪

 y5=awgn(y4,snr);%已调信号 加入噪声。

%% 3.带通滤波器

[y6] =AM_bandpass(y5,Fc,fs,F);


%% 4.解调
demodType=0; %解调方式，0：包络检波，1：相干解调
if demodType==0
    %包络检波
    Y = abs(hilbert(y6));
    Y = Y-A0;
end
if demodType==1
    %相干解调
    x3=y6.*y3;		%乘载波
    Y=AM_lowpass(x3,fs,F);%低通滤波
    Y=(Y-A0/2)*2;%去掉直流分量,幅度恢复。
end
%% 5.输出波形
%% 软件仿真波形
figure(1)
subplot(411);
dt=1/fs;
t=0:dt:(N-1)*dt;
plot(t,y1);title('调制信号')
xlabel('时间(s)');ylabel('幅值(v)');
subplot(412);
plot(t,y2);title('加直流分量后信号');
xlabel('时间(s)');ylabel('幅值(v)');
subplot(413);
plot(t,y3);title('载波信号');
xlabel('时间(s)');ylabel('幅值(v)');
subplot(414);
plot(t,y4);title('已调信号');
xlabel('时间(s)');ylabel('幅值(v)');


figure(2)
subplot(411)
plot(t,y4)
title('已调信号');
subplot(412)
plot(t,y5)
title('加噪声后信号')
subplot(413)
plot(t,y6)
title('带通滤波后信号')  
subplot(414);
plot(t,Y);title('解调信号');
xlabel('时间(s)');ylabel('幅值(v)');

%%----------------------------Student Program End------------------------%%