%%---------------------------Example-------------------------------------%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % LabName:             SSB调制解调实验
% % Task:                SSB调制解调
% % Task:                1.对调制信号进行SSB（下边带）调制解调
% %                      2.绘制出DSB调制解调实验过程波形图
% %                      3.将调制信号和已调信号信号分别输出CH1、CH2，
% %                       用示波器观察信号时域波形和已调信号频谱
% % Programming tips:    1.调制：使用相移法实现SSB调制
% %                      2.信道加噪：已调信号加入噪声得到加噪声后信号
% %                      3.带通滤波器：滤除除已调信号外的噪声信号
% %                      4.解调：相干载波与带通滤波后信号相乘，经过低通滤波器  
% %                        取出低频分量，得到解调信号      
% %                      5.输出波形
% %                        绘制出SSB调制解调过程波形图
% %                        示波器CH1通道输出调制信号波形
% %                        示波器CH2通道输出（下边带）已调信号波形
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  History
%    1. Date:           2019-10-10
%       Author:         xxxx
%       Version:        1.1
%       Modification:   初稿
% %   2. Date:           2020-8-24
% %      Author:         DIAN
% %      Version:        1.2
% %      Modification:   课后习题
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Parameter List:       
% %      Output Parameter
% %          y1  调制信号
% %          y2  载波信号
% %          y3_0  已调信号（下边带）
% %          y3_1  已调信号（上边带）
% %          y4  加噪声后信号
% %          y5  带通滤波后信号
% %          Y   解调信号
% %          Si  解调器输入端信号功率
% %          Ni  解调器输入端噪声功率
% %          So  解调器输出端信号功率
% %          No  解调器输出端噪声功率 
% %      Input Parameter
% %          A   调制信号幅度
% %          F   调制信号频率
% %          Fc  载波频率
% %          N   采样点数
% %          fs  采样频率
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

clc
clear
close all
PC_IP = '192.168.1.180';
XSRP_IP = '192.168.1.166';
fs=30720000;% 采样率,硬件系统基准采样率30.72 MHz，fs可配30.72MHz, 3.72Mhz，307.2KHz , 30.72KHz，或其它(要求fs需被30720000整除).fs最大可配30.72MHz,fs最小可配30000Hz
runType=1;%运行方式，0表示仿真，1表示软硬结合

A = 1;      %调制信号幅度
F=10000;       %调制信号频率
Fc=100000;     %载波频率
N=30720  ;  %采样点数
snr=10;     %信道输出端信噪比/dB 
%% 1.调制
dt=1/fs;
t=0:dt:(N-1)*dt;
y1=A*sin(2*pi*F*t);	%调制信号

y2=cos(2*pi*Fc*t);      %载波

y3_0 = (1/2)*y1.*y2 +(1/2)*imag(hilbert(y1)).*sin(2*pi*Fc*t);%（下边带）已调信号

%% 2.信道加噪

y4=awgn(y3_0,snr);
n0=periodogram(y4-y3_0,[],'onesided',512,fs)   ;      %  白噪声单边功率谱密度n0
P = fs/512 * (sum(n0) - 0.5*(n0(1) + n0(end)));% 积分获得噪声功率
%% 3.带通滤波器

[y5] =SSB_bandpass(y4,Fc,fs,F);
%% 4.解调
x3=y5.*y2;		%乘载波
Y=SSB_lowpass(x3,fs,F);%低通滤波

%% 5.输出波形
%软件仿真波形
figure(1)
dt=1/fs;
t=0:dt:(N-1)*dt;
subplot(411);
plot(t,y1);title('调制信号')
xlabel('时间(s)');ylabel('幅值(v)');
subplot(412);
plot(t,y2);title('载波');
xlabel('时间(s)');ylabel('幅值(v)');
subplot(413);
plot(t,y3_0);title('SSB下边带已调信号');
freq=fft(y3_0);%对carrier做N点FFT，结果为N点的复值，每一个点对应一个频率点
freqPixel=fs/N;%频率分辨率，即点与点之间频率单位
w=(-N/2:1:N/2-1)*freqPixel;%频率
m_FFT_0=abs(fftshift(freq))./max(abs(fftshift(freq)));% 频谱幅值归一化
shape_sig_freq_0=w+m_FFT_0*j;%复数
subplot(414);
plot(shape_sig_freq_0);title('SSB下边带已调信号频谱');

figure(2)
subplot(411)
plot(t,y4);title('加噪声后信号');
xlabel('时间(s)');ylabel('幅值(v)');
subplot(412)
plot(t,y5);title('带通滤波后信号');
xlabel('时间(s)');ylabel('幅值(v)');
subplot(413);
plot(t,y2);title('载波');
xlabel('时间(s)');ylabel('幅值(v)');
subplot(414);
plot(t,Y);title('解调信号');
xlabel('时间(s)');ylabel('幅值(v)');
%示波器实测波形
% 调用DA输出函数（输出到示波器）
% if  runType==1
%     CH1_data=y1;%示波器CH1通道输出波形
%     CH2_data=y3_0;%示波器CH2通道输出波形
%     divFreq=floor(30720000/fs-1);%分频值,999分频系统采样率为30720Hz,  99分频系统采样率为307200Hz, 9分频系统采样率为 3072000Hz,  0分频系统采样率30720000Hz
%     dataNum=N;
%     isGain=1;%增益开关，0表示不对值放大，1表示对值放大
%   DA_OUT(CH1_data,CH2_data,divFreq,dataNum,isGain,PC_IP,XSRP_IP);%调用此函数之前，确保XSRP开启及线连接正常
% end
%%---------------------------Example End---------------------------------%%



%%%----------------------------Student Program1---------------------------%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%简单%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % LabName:             SSB调制解调实验              
% % Task:                1.参考例程（下边带）已调信号的产生，对调制信号进行
% %                        SSB（上边带）调制解调
% %                      2.绘制出SSB调制解调实验过程波形图
% %                      3.将调制信号和已调信号信号分别输出CH1、CH2，
% %                        用示波器观察信号时域波形和已调信号频谱                                                             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%----------------------------Student Program1 End-----------------------%%

%%%----------------------------Student Program2---------------------------%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%较难%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % LabName:             SSB调制解调实验              
% % Task:                1.计算SSB（上边带）调制解调制度增益G
% % Programming tips:   1.制度增益G=输出端信噪比/输入端信噪比
% %                     2.输出信噪比
% %                       =解调器输出有用信号平均功率/解调器输出噪声平均功率
% %                        解调器输出噪声=解调信号-低通滤波器后输出信号
% %                     3.输入信噪比
% %                       =解调器输入已调信号平均功率/解调器输入噪声平均功率                                                          
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%----------------------------Student Program2 End-----------------------%%
