%%---------------------------Example-------------------------------------%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % LabName:             DSB调制解调实验
% % Task:                1.对调制信号进行DSB调制解调
% %                      2.绘制出DSB调制解调实验过程波形图
% %                      3.将调制信号和已调信号分别输出CH1、CH2，用示波器观察信
% %                       号时域波形和已调信号频谱
% % Programming tips:    1.调制：调制信号载波相乘得到已调信号
% %                      2.信道加噪：已调信号加入噪声得到加噪声后信号
% %                      3.带通滤波器：滤除除已调信号外的噪声信号
% %                      4.解调：相干载波与带通滤波后信号相乘，经过低通滤波器  
% %                        取出低频分量，得到解调信号      
% %                      5.输出波形
% %                        绘制出DSB调制解调过程波形图
% %                        示波器CH1通道输出调制信号波形
% %                        示波器CH2通道输出已调信号波形
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % History
% %   1. Date:           2019-10-12
% %      Author:         XXXX
% %      Version:        1.1
% %      Modification:   初稿
% %   2. Date:           2020-8-21
% %      Author:         DIAN
% %      Version:        1.2
% %      Modification:   课后习题
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Parameter List:       
% %      Output Parameter
% %          y1  调制信号
% %          y2  载波信号
% %          y3  已调信号
% %          y4  加噪声后信号
% %          y5  带通滤波后信号
% %          Y   解调信号
% %          Si  解调器输入端信号功率
% %          Ni  解调器输入端噪声功率
% %          So  解调器输出端信号功率
% %          No  解调器输出端噪声功率 
% %      Input Parameter
% %          A   调制信号幅度
% %          F   调制信号频率
% %          Fc  载波频率
% %          N   采样点数
% %          fs  采样频率
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
clc
clear
close all
PC_IP = '192.168.1.180';
XSRP_IP = '192.168.1.166';
fs=30720000;% 采样率,硬件系统基准采样率30.72 MHz，fs可配30.72MHz, 3.72Mhz，307.2KHz , 30.72KHz，或其它(要求fs需被30720000整除).fs最大可配30.72MHz,fs最小可配30000Hz
runType=1;%运行方式，0表示仿真，1表示软硬结合

A = 5;      %调制信号幅度
F=10000;   %调制信号频率
Fc=50000;  %载波频率
N=30720;    %采样点数
snr=10;     %信道输入信噪比/dB
%% 1.调制
%%生成调制信号
dt=1/fs;
t=0:dt:(N-1)*dt;
y1=A*sin(2*pi*F*t); 	%调制信号
y2=cos(2*pi*Fc*t);      %载波
y3=y2.*y1;              %乘载波


%% 2.信道加噪

y4=awgn(y3,snr);%加噪声后信号
n0=periodogram(y4-y3,[],'onesided',512,fs)   ;      %  白噪声单边功率谱密度n0


%% 3.过带通滤波器
[y5] =DSB_bandpass(y4,Fc,fs,F);


%% 4.解调
[Y] =DSB_Decode(y5,y2,F,fs);
%% 5.输出波形
%软件仿真波形
figure(1)
subplot(311);
dt=1/fs;
t=0:dt:(30720-1)*dt;
plot(t,y1);title('调制信号')
xlabel('时间(s)');ylabel('幅值(v)');
subplot(312);
plot(t,y2);title('载波');
xlabel('时间(s)');ylabel('幅值(v)');
subplot(313);
plot(t,y3);title('已调信号');
xlabel('时间(s)');ylabel('幅值(v)');

figure(2)
subplot(411)
plot(t,y4);title('加噪声后信号');
xlabel('时间(s)');ylabel('幅值(v)');
subplot(412)
plot(t,y5);title('带通滤波后信号');
xlabel('时间(s)');ylabel('幅值(v)');
subplot(413);
plot(t,y2);title('载波');
xlabel('时间(s)');ylabel('幅值(v)');
subplot(414);
plot(t,Y);title('解调信号');
xlabel('时间(s)');ylabel('幅值(v)');
%示波器实测波形
%调用DA输出函数（输出到示波器）
% if  runType==1
%     CH1_data=y1;%示波器CH1通道输出波形
%     CH2_data=y3;%示波器CH2通道输出波形
%     divFreq=floor(30720000/fs-1);%分频值,999分频系统采样率为30720Hz,  99分频系统采样率为307200Hz, 9分频系统采样率为 3072000Hz,  0分频系统采样率30720000Hz
%     dataNum=N;
%     isGain=1;%增益开关，0表示不对值放大，1表示对值放大
%     DA_OUT(CH1_data,CH2_data,divFreq,dataNum,isGain,PC_IP,XSRP_IP);%调用此函数之前，确保XSRP开启及线连接正常
% end

%%---------------------------Example End---------------------------------%%


%%---------------------------Student Program-----------------------------%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % LabName:             DSB调制解调实验
% % Task:                根据例程，计算制度增益G
% % Programming tips:   1.制度增益G=输出端信噪比/输入端信噪比
% %                     2.输出信噪比
% %                       =解调器输出有用信号平均功率/解调器输出噪声平均功率
% %                     3.输入信噪比
% %                       =解调器输入已调信号平均功率/解调器输入噪声平均功率
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%---------------------------Student Program End-------------------------%%

