%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  FileName:            DSB_Decode.m
%  Description:         双边带调制    
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  Parameter List:       
%       Output Parameter
%           Y   解调信号
%       Input Parameter
%           y3  已调信号
%           y2  载波信号
%           F   调制信号频率
%           fs  载波信号
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  History
%    1. Date:           2018-05-30
%       Author:         tony.liu
%       Version:        1.1 
%       Modification:   初稿
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function [Y] =DSB_Decode(y3,y2,F,fs)

x3=y3.*y2;		%乘载波
Y=DSB_lowpass(x3,fs,F);
Y=Y*2;

end

